"""
Module: laghuvu_guruvu.py
Description: Contains basic utility functions. (For future purpose)
Author: Boddu Swathi Sree
License: MIT
"""

class Varnamala:
    """
    ## Telugu Varnamala
    
    ## Attributes
    -------------
    1. varnamala: list
        - Telugu Varnamala.
    2. sankhya: list
        - Telugu numericals.
    3. gunintha_chihnam: list
        - Telugu symbols for Gunintham (Consonant+Vowel Combinations).
    4. gunintham: dict
        - key (str): Hallu (Consonant)
        - value (list): Gunintha Aksharams

    ## Methods
    ----------
    1. varnamala_map
        - Telugu Varnamala - ASCII number map.
    2. combine_rv
        - Generate Gunintha Aksharam.
    """
    

    def __init__( self ):

        self.varnamala= [
                        'అ','ఆ','ఇ','ఈ','ఉ','ఊ','ఋ','ౠ','ఎ','ఏ','ఐ','ఒ','ఓ','ఔ', # add am, aha
                        'క','ఖ','గ', 'ఘ', 'ఙ',
                        'చ','ఛ','జ','ఝ', 'ఞ',
                        'ట','ఠ','డ', 'ఢ', 'ణ',
                        'త', 'థ', 'ద','ధ','న',
                        'ప','ఫ','బ','భ', 'మ',
                        'య', 'ర', 'ల','వ','శ','ష','స','హ', 'ళ', 'ఱ'
                    ]

        self.sankhya= [ "౦", "౧", "౨", "౩", "౪", "౫", "౬", "౭", "౮", "౯"]

        self.gunintha_chihnam= [" ","ా","ి","ీ","ు","ూ","ృ","ౄ","ె","ే","ై","ొ","ో","ౌ","ಂ","ಃ"]

        self.gunintham= {
                        'క': ['క','కా','కి','కీ','కు','కూ','కృ','కౄ','కె','కే','కై','కొ','కో','కౌ','కం','కః'],
                        'ఖ': ['ఖ','ఖా','ఖి','ఖీ','ఖు','ఖూ','ఖృ','ఖౄ','ఖె','ఖే','ఖై','ఖొ','ఖో','ఖౌ','ఖం','ఖః'],
                        'గ': ['గ','గా','గి','గీ','గు','గూ','గృ','గౄ','గె','గే','గై','గొ','గో','గౌ','గం','గః'],
                        'ఘ': ['ఘ','ఘా','ఘి','ఘీ','ఘు','ఘూ','ఘృ','ఘౄ','ఘె','ఘే','ఘై','ఘొ','ఘో','ఘౌ','ఘం','ఘః'],
                        'చ': ['చ','చా','చి','చీ','చు','చూ','చృ','చౄ','చె','చే','చై','చొ','చో','చౌ','చం','చః'],
                        'ఛ': ['ఛ','ఛా','ఛి','ఛీ','ఛు','ఛూ','ఛృ','ఛౄ','ఛె','ఛే','ఛై','ఛొ','ఛో','ఛౌ','ఛం','ఛః'],
                        'జ': ['జ','జా','జి','జీ','జు','జూ','జృ','జౄ','జె','జే','జై','జొ','జో','జౌ','జం','జః'],
                        'ఝ': ['ఝ','ఝా','ఝి','ఝీ','ఝు','ఝూ','ఝృ','ఝౄ', 'ఝె','ఝే','ఝై','ఝొ','ఝో','ఝౌ','ఝం','ఝః'],
                        'ట': ['ట','టా','టి','టీ','టు','టూ','టృ','టౄ','టె','టే','టై','టొ', 'టో', 'టౌ','టం','టః'],
                        'ఠ': ['ఠ','ఠా','ఠి','ఠీ','ఠు','ఠూ','ఠృ','ఠౄ','ఠె','ఠే','ఠై','ఠొ','ఠో','ఠౌ','ఠం','ఠః'],
                        'డ': ['డ','డా','డి','డీ','డు','డూ','డృ','డౄ', 'డె','డే','డై','డొ','డో','డౌ','డం','డః'],
                        'ఢ': ['ఢ','ఢా','ఢి','ఢీ','ఢు','ఢూ','ఢృ','ఢౄ','ఢె','ఢే','ఢై','ఢొ','ఢో','ఢౌ','ఢం','ఢః'],
                        'ణ': ['ణ','ణా','ణి','ణీ','ణు','ణూ','ణృ','ణౄ','ణె','ణే','ణై','ణొ','ణో','ణౌ','ణం','ణః'],
                        'త': ['త','తా','తి','తీ','తు','తూ','తృ','తౄ','తె','తే','తై','తొ','తో','తౌ','తం','తః'],
                        'థ': ['థ','థా','థి','థీ','థు','థూ','థృ','థౄ','థె','థే','థై','థొ','థో','ధౌ','థం','థః'],
                        'ద': ['ద','దా','ది','దీ','దు','దూ','దృ','ధౄ','దె','దే','దై','దొ','దో','దౌ','దం','దః'],
                        'ధ': ['ధ','ధా','ధి','ధీ','ధు','ధూ','ధృ','ధౄ','ధె','ధే','ధై','ధొ','ధో','ధౌ','ధం','ధః'],
                        'న': ['న','నా','ని','నీ','ను','నూ','నృ','నౄ','నె','నే','నై','నొ','నో','నౌ','నం','నః'],
                        'ప': ['ప','పా','పి','పీ','పు','పూ','పృ','పౄ','పె','పే','పై','పొ','పో','పౌ','పం','పః'],
                        'ఫ': ['ఫ','ఫా','ఫి','ఫీ','ఫు','ఫూ','ఫృ','ఫౄ','ఫె','ఫే','ఫై','ఫొ','ఫో','ఫౌ','ఫం','ఫః'],
                        'బ': ['బ','బా','బి','బీ','బు','బూ','బృ','బౄ','బె','బే','బై','బొ','బో','బౌ','బం','బః'],
                        'భ': ['భ','భా','భి','భీ','భు','భూ','భృ','భౄ','భె','భే','భై','భొ','భో','భౌ','భం','భః'],
                        'మ': ['మ','మా','మి','మీ','ము','మూ','మృ','మౄ','మె','మే','మై','మొ','మో','మౌ','మం','మః'],
                        'య': ['య','యా','యి','యీ','యు','యూ','యృ','యౄ','యె','యే','యై','యొ','యో','యౌ','యం','యః'],
                        'ర': ['ర','రా','రి','రీ','రు','రూ','రృ','రౄ','రె','రే','రై','రొ','రో','రౌ','రం','రః'],
                        'ల': ['ల','లా', 'లి', 'లీ', 'లు', 'లూ', 'లృ', 'లౄ','లె','లే','లై','లొ','లో','లౌ','లం','లః'],
                        'వ': ['వ','వా','వి','వీ','వు','వూ','వృ','వౄ','వె','వే','వై','వొ','వో','వౌ','వం','వః'],
                        'శ': ['శ','శా', 'శి','శీ','శు','శూ','శృ','శౄ','శె','శే','శై','శొ','శో','శౌ','శం','శః'],
                        'ష': ['ష','షా','షి','షీ','షు','షూ','షృ','షౄ','షె','షే','షై','షొ','షో','షౌ','షం','షః'],
                        'స': ['స','సా','సి','సీ','సు','సూ','సృ','సౄ','సె','సే','సై','సొ','సో','సౌ','సం','సః'],
                        'హ': ['హ','హా','హి','హీ','హు','హూ','హృ','హౄ','హె','హే','హై','హొ','హో','హౌ','హం','హః'],
                        'ళ': ['ళ','ళా','ళి','ళీ','ళు','ళూ','ళృ','ళౄ','ళె','ళే','ళై','ళొ','ళో','ళౌ','ళం','ళః']
                        }


    def varnamala_map( self, to_num= True ):
        """
        ## Telugu Varnamala - ASCII number map
        
        ## Parameters
        -------------
        1. to_num: bool
            - If 'True' then returns Telugu character to ASCII number map.
            - Default is set to 'True'.

        ## Returns
        ----------
        Dictionary of Telugu Varnamala - ASCII number.
        """
        
        if to_num == False:
            return {ord(i): i for i in self.varnamala}
        
        return {i: ord(i) for i in self.varnamala}
    

    def combine_rv( self, root, vowel_sound ):
        """
        ## Combines root consonant with the gunintha chihnam to get corresponding Gunintha Aksharam
        ## where Gunintha Aksharam= Consonant + Gunintha Chihnam of vowel sound.

        ## Parameters
        -------------
        1. root: str
            - Consonant (Hallu).
        2. vowel_sound: str
            - Gunintha chihnam of required vowel sound.

        ## Returns
        ----------
        Returns string of Gunintha Aksharam.
        """
        
        if len(root)>1:
            root= root[0]

        return self.gunintham[ root ][self.gunintha_chihnam.index( vowel_sound )]