"""
Module: ganam.py
Description: Contains configurations for each "Ganam"
Author: Boddu Sri Pavan
License: MIT
"""

# Ganam name to Ganam symbols
ganamulu= {
            'గ': ("U",),
            'ల': ("|",),
            'లా': ("|", "|"),
            'వ': ("|", "U"),
            'హ': ("U", "|"),
            'గా': ("U", "U"),
            'న': ("|", "|", "|"),
            'స': ("|", "|", "U"),
            'జ': ("|", "U", "|"),
            'య': ("|", "U", "U"),
            'భ': ("U", "|", "|"),
            'ర': ("U", "|", "U"),
            'త': ("U", "U", "|"),
            'మ': ("U", "U", "U"),
            'నల': ("|", "|", "|", "|"),
            'నగ': ("|", "|", "|", "U"),
            'సల': ("|", "|", "U", "|")
}

# Ganam symbols to Ganam name
r_ganamulu= {
                ("U",): 'గ',
                ("|",): 'ల',
                ("|", "|"): 'లా',
                ("|", "U"): 'వ',
                ("U", "|"): 'హ',
                ("U", "U"): 'గా',
                ("|", "|", "|"): 'న',
                ("|", "|", "U"): 'స',
                ("|", "U", "|"): 'జ',
                ("|", "U", "U"): 'య',
                ("U", "|", "|"): 'భ',
                ("U", "|", "U"): 'ర',
                ("U", "U", "|"): 'త',
                ("U", "U", "U"): 'మ',
                ("|", "|", "|", "|"): 'నల',
                ("|", "|", "|", "U"): 'నగ',
                ("|", "|", "U", "|"): 'సల'
}


# Ganams with single(n= 1) Aksharam Token
eka= {
    'గ': ("U",),
    'ల': ("|",)
}
r_eka= {
    ("U",): 'గ',
    ("|",): 'ల',
    "U": 'గ',
    "|": 'ల',
}

# Ganams with two(n= 2) Aksharam Tokens
dwi= {
    'లా': ("|", "|"),
    'వ': ("|", "U"),
    'హ': ("U", "|"),
    'గా': ("U", "U")
}
r_dwi= {
    ("|", "|"): 'లా',
    ("|", "U"): 'వ',
    ("U", "|"): 'హ',
    ("U", "U"): 'గా'
}

# Ganams with three(n= 3) Aksharam Tokens
tria= {
    'న': ("|", "|", "|"),
    'స': ("|", "|", "U"),
    'జ': ("|", "U", "|"),
    'య': ("|", "U", "U"),
    'భ': ("U", "|", "|"),
    'ర': ("U", "|", "U"),
    'త': ("U", "U", "|"),
    'మ': ("U", "U", "U")
}
r_tria= {
    ("|", "|", "|"): 'న',
    ("|", "|", "U"): 'స',
    ("|", "U", "|"): 'జ',
    ("|", "U", "U"): 'య',
    ("U", "|", "|"): 'భ',
    ("U", "|", "U"): 'ర',
    ("U", "U", "|"): 'త',
    ("U", "U", "U"): 'మ'
}

# Ganams with four(n= 4) Aksharam Tokens
chatura= {
    'నల': ("|", "|", "|", "|"),
    'నగ': ("|", "|", "|", "U"),
    'సల': ("|", "|", "U", "|")
}
r_chatura= {
    ("|", "|", "|", "|"): 'నల',
    ("|", "|", "|", "U"): 'నగ',
    ("|", "|", "U", "|"): 'సల'
}

# Indra Ganams
indra_ganam= {
                'భ': ("U", "|", "|"),
                'ర': ("U", "|", "U"),
                'త': ("U", "U", "|"),
                'నల': ("|", "|", "|", "|"),
                'నగ': ("|", "|", "|", "U"),
                'సల': ("|", "|", "U", "|")
            }
r_indra_ganam= {
                    ("U", "|", "|"): 'భ',
                    ("U", "|", "U"): 'ర',
                    ("U", "U", "|"): 'త',
                    ("|", "|", "|", "|"): 'నల',
                    ("|", "|", "|", "U"): 'నగ',
                    ("|", "|", "U", "|"): 'సల'
                }

# Surya Ganams
surya_ganam= {
                'హ': ("U", "|"),
                'న': ("|", "|", "|")
            }
r_surya_ganam= {
                    ("U", "|"): 'హ',
                    ("|", "|", "|"): 'న'
                }

# Individual Ganam maps (for Padyam type detection)
bha_ganam= {'భ': ("U", "|", "|")}
ra_ganam= {'ర': ("U", "|", "U")}
na_ganam= {'న': ("|", "|", "|")}
va_ganam= {'వ': ("|", "U")}
ja_ganam= {'జ': ("|", "U", "|")}
ma_ganam= {'మ': ("U", "U", "U")}
sa_ganam= {'స': ("|", "|", "U")}
ta_ganam= {'త': ("U", "U", "|")}
ga_ganam= {'గ': ("U",)}
ya_ganam= {'య': ("|", "U", "U")}
nala_ganam= {'నల': ("|", "|", "|", "|")}
gaga_ganam= {'గా': ("U", "U")} # gaaa is also called as "Gaga"

# Ganam maps for Kanda padyam
kandam_all= {
                'గా': ("U", "U"),
                'భ': ("U", "|", "|"),
                'స': ("|", "|", "U"),
                'జ': ("|", "U", "|"),
                'నల': ("|", "|", "|", "|")
            }

kandam_odd= {
                'గా': ("U", "U"),
                'భ': ("U", "|", "|"),
                'స': ("|", "|", "U"),
                'నల': ("|", "|", "|", "|")
            }

kandam_2_4_last= {
                    'గా': ("U", "U"),
                    'స': ("|", "|", "U")
                }

kandam_6= {
                'జ': ("|", "U", "|"),
                'నల': ("|", "|", "|", "|")
        }