"""
Module: ganam.py
Description: Contains configurations for each "Ganam"
Author: Boddu Sri Pavan
Date: 21-06-2025
License: MIT
"""

ganamulu= {
            'గ': ("U",),
            'ల': ("|",),
            'లా': ("|", "|"),
            'వ': ("|", "U"),
            'హ': ("U", "|"),
            'గా': ("U", "U"),
            న': ("|", "|", "|"),
            'స': ("|", "|", "U"),
            'జ': ("|", "U", "|"),
            'య': ("|", "U", "U"),
            'భ': '("U", "|", "|"),
            'ర': ("U", "|", "U"),
            'త': ("U", "U", "|"),
            'మ': ("U", "U", "U"),
            'నల': ("|", "|", "|", "|"),
            'నగ': ("|", "|", "|", "U"),
            'సల': ("|", "|", "U", "|")
}
r_ganamulu= {
                ("U",): 'గ',
                ("|",): 'ల',
                ("|", "|"): 'లా',
                ("|", "U"): 'వ',
                ("U", "|"): 'హ',
                ("U", "U"): 'గా',
                ("|", "|", "|"): 'న',
                ("|", "|", "U"): 'స',
                ("|", "U", "|"): 'జ',
                ("|", "U", "U"): 'య',
                ("U", "|", "|"): 'భ',
                ("U", "|", "U"): 'ర',
                ("U", "U", "|"): 'త',
                ("U", "U", "U"): 'మ',
                ("|", "|", "|", "|"): 'నల',
                ("|", "|", "|", "U"): 'నగ',
                ("|", "|", "U", "|"): 'సల'
}


# Ganams are divided into 4 types based on the no.of aksharams present.
# No.of aksharams: 1
eka= {
    'గ': ("U",),
    'ల': ("|",)
}
r_eka= {
    ("U",): 'గ',
    ("|",): 'ల',
    "U": 'గ',
    "|": 'ల',
}

# No.of aksharams: 2
dwi= {
    'లా': ("|", "|"),
    'వ': ("|", "U"),
    'హ': ("U", "|"),
    'గా': ("U", "U")
}
r_dwi= {
    ("|", "|"): 'లా',
    ("|", "U"): 'వ',
    ("U", "|"): 'హ',
    ("U", "U"): 'గా'
}


# No.of aksharams: 3
tria= {
    'న': ("|", "|", "|"),
    'స': ("|", "|", "U"),
    'జ': ("|", "U", "|"),
    'య': ("|", "U", "U"),
    'భ': ("U", "|", "|"),
    'ర': ("U", "|", "U"),
    'త': ("U", "U", "|"),
    'మ': ("U", "U", "U")
}
r_tria= {
    ("|", "|", "|"): 'న',
    ("|", "|", "U"): 'స',
    ("|", "U", "|"): 'జ',
    ("|", "U", "U"): 'య',
    ("U", "|", "|"): 'భ',
    ("U", "|", "U"): 'ర',
    ("U", "U", "|"): 'త',
    ("U", "U", "U"): 'మ'
}

# No.of aksharams: 4
chatura= {
    'నల': ("|", "|", "|", "|"),
    'నగ': ("|", "|", "|", "U"),
    'సల': ("|", "|", "U", "|")
}
r_chatura= {
    ("|", "|", "|", "|"): 'నల',
    ("|", "|", "|", "U"): 'నగ',
    ("|", "|", "U", "|"): 'సల'
}

# There are 2 types of gana swarupamulu
# Indra Ganaalu
indra_ganam= [ 'నల', 'నగ', 'సల', 'భ', 'ర', 'త' ]
r_indra_ganam= [("|", "|", "|", "|"), ("|", "|", "|", "U"), ("|", "|", "U", "|"), 
                ("U", "|", "|"), ("U", "|", "U"), ("U", "U", "|")]

# Surya Ganaalu
surya_ganam= [ 'న', 'హ' ]
r_surya_ganam= [("|", "|", "|"), ("U", "|")]