tetageethi= {}
tetageethi_example=['''విని దశగ్రీవు డంగజ వివశు డగుచు
                    నర్థి బంచిన బసిడిఱ్రి యై నటించు
                    నీచు మారీచు రాముడు నెఱి వధించె
                    నంతలో సీత గొనిపోయె నసురవిభుడు''']
aataveladi= {}
aataveladi_example=['''ఉప్పుకప్పురంబు ఒక్కపోలికనుండు,
                    చూడచూడ రుచుల జాడవేరు,
                    పురుషులందు పుణ్యపురుషులు వేరయా
                    విశ్వదాభిరామ వినుర వేమ!''']
seesam= {}
seesam_example=['''కలుగడే నాపాలి కలిమి సందేహింప
                గలిమిలేములు లేక కలుగువాడు;
                నా కడ్డపడ రాడె నలి న సాధువులచే
                బడిన సాధుల కడ్డపడెడువాడు
                చూడడే నా పాటు జూపుల జూడక
                చూచువారల గృపజూచువాడు;
                లీలతో నా మొఱాలింపడే మొఱగుల
                మొఱ లెఱుంగుచు దన్ను మొఱగువాడు;''']